<a href='https://www.darshan.ac.in/'> <img src='https://www.darshan.ac.in/Content/media/DU_Logo.svg' width="250" height="300"/></a>
<pre>
<center><b><h1>Data Mining</b></center>
<center><b><h1>Lab - 2</b></center>   
<center><b><h1>Shruti | 23010101311 | 13-06-2025</b></center>   
<pre>
#  Numpy  &  Perform Data Exploration with Pandas

-------------------------------------------------------------------------------
## Numpy

1) NumPy (Numerical Python) is a powerful open-source library in Python used for numerical and scientific computing.<br>
2) It provides support for large, multi-dimensional arrays and matrices, along with a collection of mathematical functions to operate on them efficiently.<br>
3) NumPy is highly optimized and written in C, making it much faster than using regular Python lists for numerical operations.<br>
4) It serves as the foundation for many other Python libraries in data science and machine learning, like pandas, TensorFlow, and scikit-learn.<br>
5) With features like broadcasting, vectorization, and integration with C/C++ code, NumPy allows for cleaner and faster code in numerical computations.<br>



### Step 1. Import the Numpy library

In [5]:
import numpy as np



### Step 2. Create a 1D array of numbers

In [9]:
arr = np.array([1,2,3,4,5,6,7])
arr

array([1, 2, 3, 4, 5, 6, 7])

In [11]:
type(arr)

numpy.ndarray

In [15]:
arr1 = np.arange(10)
arr1

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [17]:
#ndim uses for dimention
arr1.ndim

1

In [19]:
#property size uses to get array size
arr1.size

10

In [21]:
#uses to get datatype of individual element of array
arr1.dtype

dtype('int32')

In [22]:
arr2 = np.arange(101,201)
arr2

array([101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113,
       114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126,
       127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139,
       140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152,
       153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165,
       166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178,
       179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191,
       192, 193, 194, 195, 196, 197, 198, 199, 200])

In [18]:
arr3 = np.array([[1,2],[1,3]])
arr3

array([[1, 2],
       [1, 3]])

### Step 3. Reshape 1D to 2D Array

In [24]:
#to reshape data in rows and columns arr.reshape(rows,columns) where arr is that which we want to reshape
arr4 = arr2.reshape(4,25)
arr4

array([[101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113,
        114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125],
       [126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,
        139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150],
       [151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163,
        164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175],
       [176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188,
        189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200]])

In [26]:
arr5 = np.arange(12).reshape(3,4)
arr5

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [28]:
arr6 = np.arange(10).reshape(3,4)
arr6
#throw error bcz our array size is 10 and we are trying to reshape 12 elements

ValueError: cannot reshape array of size 10 into shape (3,4)

### Step 4. Create a Linspace array

In [30]:
#use to get equally spaced adjacent elements(in real life :- use in graph plot for accurate graph)
#np.linspace(start,end,numofelements)
arr7 = np.linspace(1,6,3)
arr7

array([1. , 3.5, 6. ])

### Step 5. Create a Random Numbered Array

In [43]:
#returns array (generated elements are between 0 to 1)
n = np.random.rand(5)
n

array([0.29413935, 0.38783556, 0.55813487, 0.23200828, 0.91802345])

### Step 6. Create a Random Integer Array

In [32]:
arr8 = np.random.randint(1,50,3)
arr8

array([49, 18, 11])

In [34]:
arr9 = np.random.randint(1,50,20).reshape(2,10)
arr9

array([[29, 17, 28, 28, 11, 44, 10, 31,  7,  8],
       [10,  2, 36, 11, 23, 19, 42,  8, 18, 27]])

### Step 7. Create a 1D Array and get Max,Min,ArgMax,ArgMin

In [36]:
arr2.min()

101

In [38]:
arr2.max()

200

In [40]:
#returns index of maxvalue
arr2.argmax()

99

In [42]:
#returns index of minvalue
arr2.argmin()

0

### Step 8. Indexing in 1D Array

In [7]:
arr = np.random.randint(1,20,11)
arr

array([ 2,  6,  6,  2,  9, 12,  4,  8,  2, 15, 16])

In [9]:
arr[6]

4

In [11]:
#slicing
#arr[start:end:step]
#arr[:6:] or...
arr[:6]

array([ 2,  6,  6,  2,  9, 12])

In [13]:
arr[7:]
# or arr[7::]

array([ 8,  2, 15, 16])

In [15]:
#to get alternate elements
arr[::2]

array([ 2,  6,  9,  4,  2, 16])

### Step 9. Indexing in 2D Array

In [107]:
arr = np.arange(15).reshape(3,5)
arr

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

In [88]:
arr[0,2]

2

In [90]:
arr[1][3]

8

In [95]:
arr[1::]

array([[ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

In [97]:
arr[:1:]

array([[0, 1, 2, 3, 4]])

In [99]:
arr[:2:]

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [109]:
arr[::2]

array([[ 0,  1,  2,  3,  4],
       [10, 11, 12, 13, 14]])

In [111]:
#arr[forrows,forcolumns]
arr[::2,::2]

array([[ 0,  2,  4],
       [10, 12, 14]])

In [114]:
arr[::,::2]

array([[ 0,  2,  4],
       [ 5,  7,  9],
       [10, 12, 14]])

In [116]:
arr[1::,::2]

array([[ 5,  7,  9],
       [10, 12, 14]])

In [118]:
arr[:2:,1::3]

array([[1, 4],
       [6, 9]])

### Step 10. Conditional Selection

In [120]:
arr = np.random.randint(1,20,10)
arr

array([11,  4, 17, 15,  3, 14, 16,  6, 15, 11])

In [122]:
arr[arr>10]

array([11, 17, 15, 14, 16, 15, 11])

In [126]:
arr1 = np.arange(15).reshape(3,5)
arr1

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

In [128]:
arr1[arr1>10]

array([11, 12, 13, 14])

In [132]:
arr1[(arr1>5) & (arr1<12)]

array([ 6,  7,  8,  9, 10, 11])

In [142]:
arr1[(arr1==5) | (arr1==6)]

array([5, 6])

### 🔥You did it! 10 exercises down — you're on fire! 🔥

## Pandas



### Step 1. Import the necessary libraries

In [54]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [82]:
#CSV = Comma-Separated Values
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user')
users

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
..                                     ...
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

In [84]:
#index column means primary key
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|',index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. See the first 25 entries

In [164]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [166]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [180]:
# 0 for rows and 1 for columns
users.shape[0]

943

### Step 7. What is the number of columns in the dataset?

In [178]:
users.shape[1]

4

### Step 8. Print the name of all the columns.

In [182]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [184]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [186]:
users.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [188]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [190]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [198]:
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [202]:
users['occupation'].nunique()

21

In [200]:
users['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [204]:
len(users['occupation'].unique())

21

### Step 13. What is the most frequent occupation?

In [96]:
#this fun returns Count of each occupation type (value_counts())
users.occupation.value_counts().head(1)

occupation
student    196
Name: count, dtype: int64

### Step 14. Summarize the DataFrame.

In [194]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [212]:
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [214]:
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [216]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [224]:
users['age'].mean(numeric_only=True)

34.05196182396607

### Step 18. What is the age with least occurrence?

In [220]:
users.age.value_counts().tail()

age
7     1
66    1
11    1
10    1
73    1
Name: count, dtype: int64

### You're not just learning, you're mastering it. Keep aiming higher! 🚀